# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'htop'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'docker-machine'
brew 'jq'
brew 'lsof'
brew 'z'
brew 'zsh-syntax-highlighting'

# Development
#brew 'php72'

# Apps
cask 'adobe-acrobat-reader'
cask 'visual-studio-code'
cask 'cyberduck'
cask 'fugu'
cask 'hyperdock'
cask 'mongodb-compass'
cask 'mongodb'
cask 'onedrive'
#cask 'PresButan'
#cask 'RedQuits'
#cask 'DisplayMenu'
cask 'rightzoom'
cask 'snagit'
cask 'sourcetree'
cask 'spectacle'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'mysqlworkbench'
cask 'dropbox'

# Fonts
#cask

# Install Mac App Store apps
#mas '1Password', id: 443987910

